feat: set up DAG 4 and DAG 5
